#include <iostream>
#include <clocale>

using namespace std;

int main(){
    setlocale(LC_ALL, "ru"); // Ã¤Ã«Ã¿ Ã°Ã³Ã±Ã±ÃªÃ¨Ãµ Ã¡Ã³ÃªÃ¢ Ã¢ ÃªÃ®Ã­Ã±Ã®Ã«Ã¨

	printf("Çàãàäàéòå ÷èñëî îò 0 äî 1024 íå âêëþ÷èòåëüíî, ÿ ïîïûòàþñü åãî óãàäàòü.\n");
	//åñëè ÷òî èãðà óãàäûâàåò ÷èñëî îò 0 äî 1023, à 1024 óãàäûâàåò ñ 11 ïîïûòêè
	printf("Îòâå÷àéòå 1, åñëè çàãàäàííîå ÷èñëî áîëüøå,\n");
        printf("-1, åñëè ìåíüøå, è 0, åñëè ÿ óãàäàþ.\n");

	int l = 0, r = 1024, s = 1, c = 1024, answer = 1; // s = ñ÷åò÷èê ïîïûòîê

	printf("Ã‡Ã Ã£Ã Ã¤Ã Ã©Ã²Ã¥ Ã·Ã¨Ã±Ã«Ã® Ã®Ã² 0 Ã¤Ã® 1024, Ã¿ Ã¯Ã®Ã¯Ã»Ã²Ã Ã¾Ã±Ã¼ Ã¥Ã£Ã® Ã³Ã£Ã Ã¤Ã Ã²Ã¼.\n");
	printf("ÃŽÃ²Ã¢Ã¥Ã·Ã Ã©Ã²Ã¥ 1, Ã¥Ã±Ã«Ã¨ Ã§Ã Ã£Ã Ã¤Ã Ã­Ã­Ã®Ã¥ Ã·Ã¨Ã±Ã«Ã® Ã¡Ã®Ã«Ã¼Ã¸Ã¥,\n");
        printf("-1, Ã¥Ã±Ã«Ã¨ Ã¬Ã¥Ã­Ã¼Ã¸Ã¥, Ã¨ 0, Ã¥Ã±Ã«Ã¨ Ã¿ Ã³Ã£Ã Ã¤Ã Ã¾.\n");

	int l = 0, r = 1024, s = 1, c, answer; // s = Ã±Ã·Ã¥Ã²Ã·Ã¨Ãª Ã¯Ã®Ã¯Ã»Ã²Ã®Ãª
	c = (l + r) / 2;
	printf("ÃÃ®Ã¯Ã»Ã²ÃªÃ  %d : %d?", s, c);
	scanf("%d", &answer);

	while (answer!=0)
	{
		c = (l + r) / 2;
		printf("Ïîïûòêà %d : %d?", s, c);
		scanf("%d", &answer);

		switch (answer)
		{
		case 1:
			//if äëÿ òîãî, ÷òîáû óãàäûâàë çà 11 ïîïûòîê 1024, òê èãðà íå óãàäûâàåò 1024 çà 10 ïîïûòîê
		//	if (++c == r)
		//	{
		//		c = r;
		//		answer = 0;
		//	}
		//	else 
				l = c;
			break;
		
		case -1:
			if (--c == r)
			{
	 		c = l;
				answer = 0;
			}
			else
				r = c;
			break;

		case 0:
			break;
		default:
			s--;
			printf("Íåïðàâèëüíî\n");
			break;
		}
		s++;
	
			printf("ÃŸ Ã³Ã£Ã Ã¤Ã Ã«");
			break;
		}
		s++;
		c = (l + r) / 2;
		printf("ÃÃ®Ã¯Ã»Ã²ÃªÃ  %d : %d?", s, c);
		scanf("%d", &answer);

	}

	printf("ß óãàäàë òâî¸ çàãàäàííîå ÷èñëî, ýòî %d ", c);
    return 0;
}
