#include <iostream>
#include <clocale>

using namespace std;

int main(){
    setlocale(LC_ALL, "ru"); // Г¤Г«Гї Г°ГіГ±Г±ГЄГЁГµ ГЎГіГЄГў Гў ГЄГ®Г­Г±Г®Г«ГЁ

<<<<<<< HEAD
	printf("Загадайте число от 0 до 1024 не включительно, я попытаюсь его угадать.\n");
	//если что игра угадывает число от 0 до 1023, а 1024 угадывает с 11 попытки
	printf("Отвечайте 1, если загаданное число больше,\n");
    printf("-1, если меньше, и 0, если я угадаю.\n");

	int l = 0, r = 1024, s = 1, c = 1024, answer = 1; // s = счетчик попыток
=======
	printf("Г‡Г ГЈГ Г¤Г Г©ГІГҐ Г·ГЁГ±Г«Г® Г®ГІ 0 Г¤Г® 1024, Гї ГЇГ®ГЇГ»ГІГ ГѕГ±Гј ГҐГЈГ® ГіГЈГ Г¤Г ГІГј.\n");
	printf("ГЋГІГўГҐГ·Г Г©ГІГҐ 1, ГҐГ±Г«ГЁ Г§Г ГЈГ Г¤Г Г­Г­Г®ГҐ Г·ГЁГ±Г«Г® ГЎГ®Г«ГјГёГҐ,\n");
        printf("-1, ГҐГ±Г«ГЁ Г¬ГҐГ­ГјГёГҐ, ГЁ 0, ГҐГ±Г«ГЁ Гї ГіГЈГ Г¤Г Гѕ.\n");

	int l = 0, r = 1024, s = 1, c, answer; // s = Г±Г·ГҐГІГ·ГЁГЄ ГЇГ®ГЇГ»ГІГ®ГЄ
	c = (l + r) / 2;
	printf("ГЏГ®ГЇГ»ГІГЄГ  %d : %d?", s, c);
	scanf("%d", &answer);
>>>>>>> 9daea23be134b8ef7fe7042d5de4f033d13b6873

	while (answer!=0)
	{
		c = (l + r) / 2;
		printf("Попытка %d : %d?", s, c);
		scanf("%d", &answer);

		switch (answer)
		{
		case 1:
			//if для того, чтобы угадывал за 11 попыток 1024, тк игра не угадывает 1024 за 10 попыток
		//	if (++c == r)
		//	{
		//		c = r;
		//		answer = 0;
		//	}
		//	else 
				l = c;
			break;
		
		case -1:
			if (--c == r)
			{
	 		c = l;
				answer = 0;
			}
			else
				r = c;
			break;

		case 0:
<<<<<<< HEAD
			break;
		default:
			s--;
			printf("Неправильно\n");
			break;
		}
		s++;
		
=======
			printf("Гџ ГіГЈГ Г¤Г Г«");
			break;
		}
		s++;
		c = (l + r) / 2;
		printf("ГЏГ®ГЇГ»ГІГЄГ  %d : %d?", s, c);
		scanf("%d", &answer);

>>>>>>> 9daea23be134b8ef7fe7042d5de4f033d13b6873
	}

	printf("Я угадал твоё загаданное число, это %d ", c);
    return 0;
}
